iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC13xx/targetInit/CortexM0_LPC13xx_sfr.h
};

#define USART3_1 (*(volatile struct USART3_1_tag *) 0x40004800)

struct UART4_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t ORE:1;
      uint64_t IDLE:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t LBD:1;
      uint64_t CTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_Fraction:4;
      uint64_t DIV_Mantissa:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t IDLEIE:1;
      uint64_t RXNEIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t PEIE:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t UE:1;
      uint64_t reservedSpace0:1;
      uint64_t OVER8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADD:4;
      uint64_t reservedSpace0:1;
      uint64_t LBDL:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t LBCL:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t CLKEN:1;
      uint64_t STOP:2;
      uint64_t LINEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDSEL:1;
      uint64_t NACK:1;
      uint64_t SCEN:1;
      uint64_t DMAR:1;
      uint64_t DMAT:1;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t CTSIE:1;
      uint64_t ONEBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTPR;

};

#define UART4_1 (*(volatile struct UART4_1_tag *) 0x40004c00)

struct UART5_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t ORE:1;
      uint64_t IDLE:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t LBD:1;
      uint64_t CTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_Fraction:4;
      uint64_t DIV_Mantissa:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t IDLEIE:1;
      uint64_t RXNEIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t PEIE:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t UE:1;
      uint64_t reservedSpace0:1;
      uint64_t OVER8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADD:4;
      uint64_t reservedSpace0:1;
      uint64_t LBDL:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t LBCL:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t CLKEN:1;
      uint64_t STOP:2;
      uint64_t LINEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDSEL:1;
      uint64_t NACK:1;
      uint64_t SCEN:1;
      uint64_t DMAR:1;
      uint64_t DMAT:1;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t CTSIE:1;
      uint64_t ONEBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTPR;

};

#define UART5_1 (*(volatile struct UART5_1_tag *) 0x40005000)

struct USB_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP5R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP6R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EA:4;
      uint64_t STAT_TX:2;
      uint64_t DTOG_TX:1;
      uint64_t CTR_TX:1;
      uint64_t EP_KIND:1;
      uint64_t EP_TYPE:2;
      uint64_t SETUP:1;
      uint64_t STAT_RX:2;
      uint64_t DTOG_RX:1;
      uint64_t CTR_RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP7R;

