iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC13xx/targetInit/CortexM0_LPC13xx_sfr.h
  uint8_t res1[3840];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR1;

  uint8_t res2[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  uint8_t res3[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN1;

  uint8_t res4[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN1;

  uint8_t res5[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET1;

